apache/nuttx/arch/arm/src/imxrt/imxrt_lpi2c.c
#ifdef CONFIG_IMXRT_LPI2C4
static const struct imxrt_lpi2c_config_s imxrt_lpi2c4_config =
{
  .base          = IMXRT_LPI2C4_BASE,
  .busy_idle     = CONFIG_LPI2C4_BUSYIDLE,
  .filtscl       = CONFIG_LPI2C4_FILTSCL,
  .filtsda       = CONFIG_LPI2C4_FILTSDA,
  .scl_pin       = GPIO_LPI2C4_SCL,
  .sda_pin       = GPIO_LPI2C4_SDA,
#if defined(CONFIG_I2C_RESET)
  .reset_scl_pin = GPIO_LPI2C4_SCL_RESET,
  .reset_sda_pin = GPIO_LPI2C4_SDA_RESET,
#endif
#ifndef CONFIG_I2C_SLAVE
  .mode          = LPI2C_MASTER,
#else
  .mode          = LPI2C_SLAVE,
#endif
#ifndef CONFIG_I2C_POLLED
  .irq           = IMXRT_IRQ_LPI2C4,
#endif
#ifdef CONFIG_LPI2C4_DMA
  .dma_reqsrc    = IMXRT_DMACHAN_LPI2C4,
#endif
};

static struct imxrt_lpi2c_priv_s imxrt_lpi2c4_priv =
{
  .ops           = &imxrt_lpi2c_ops,
  .config        = &imxrt_lpi2c4_config,
  .refs          = 0,
  .lock          = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr       = SEM_INITIALIZER(0),
#endif
  .intstate      = INTSTATE_IDLE,
  .msgc          = 0,
  .msgv          = NULL,
  .ptr           = NULL,
  .dcnt          = 0,
  .flags         = 0,
  .status        = 0
};
#endif

#ifdef CONFIG_IMXRT_LPI2C5
static const struct imxrt_lpi2c_config_s imxrt_lpi2c5_config =
{
  .base          = IMXRT_LPI2C5_BASE,
  .busy_idle     = CONFIG_LPI2C5_BUSYIDLE,
  .filtscl       = CONFIG_LPI2C5_FILTSCL,
  .filtsda       = CONFIG_LPI2C5_FILTSDA,
  .scl_pin       = GPIO_LPI2C5_SCL,
  .sda_pin       = GPIO_LPI2C5_SDA,
#if defined(CONFIG_I2C_RESET)
  .reset_scl_pin = GPIO_LPI2C5_SCL_RESET,
  .reset_sda_pin = GPIO_LPI2C5_SDA_RESET,
#endif
#ifndef CONFIG_I2C_SLAVE
  .mode          = LPI2C_MASTER,
#else
  .mode          = LPI2C_SLAVE,
#endif
#ifndef CONFIG_I2C_POLLED
  .irq           = IMXRT_IRQ_LPI2C5,
#endif
};

static struct imxrt_lpi2c_priv_s imxrt_lpi2c5_priv =
{
  .ops           = &imxrt_lpi2c_ops,
  .config        = &imxrt_lpi2c5_config,
  .refs          = 0,
  .lock          = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr       = SEM_INITIALIZER(0),
#endif
  .intstate      = INTSTATE_IDLE,
  .msgc          = 0,
  .msgv          = NULL,
  .ptr           = NULL,
  .dcnt          = 0,
  .flags         = 0,
  .status        = 0
};
#endif

#ifdef CONFIG_IMXRT_LPI2C6
static const struct imxrt_lpi2c_config_s imxrt_lpi2c6_config =
{
  .base          = IMXRT_LPI2C6_BASE,
  .busy_idle     = CONFIG_LPI2C6_BUSYIDLE,
  .filtscl       = CONFIG_LPI2C6_FILTSCL,
  .filtsda       = CONFIG_LPI2C6_FILTSDA,
  .scl_pin       = GPIO_LPI2C6_SCL,
  .sda_pin       = GPIO_LPI2C6_SDA,
#if defined(CONFIG_I2C_RESET)
  .reset_scl_pin = GPIO_LPI2C6_SCL_RESET,
  .reset_sda_pin = GPIO_LPI2C6_SDA_RESET,
#endif
#ifndef CONFIG_I2C_SLAVE
  .mode          = LPI2C_MASTER,
#else
  .mode          = LPI2C_SLAVE,
#endif
#ifndef CONFIG_I2C_POLLED
  .irq           = IMXRT_IRQ_LPI2C6,
#endif
};

static struct imxrt_lpi2c_priv_s imxrt_lpi2c6_priv =
{
  .ops           = &imxrt_lpi2c_ops,
  .config        = &imxrt_lpi2c6_config,
  .refs          = 0,
  .lock          = NXMUTEX_INITIALIZER,
#ifndef CONFIG_I2C_POLLED
  .sem_isr       = SEM_INITIALIZER(0),
#endif
  .intstate      = INTSTATE_IDLE,
  .msgc          = 0,
  .msgv          = NULL,
  .ptr           = NULL,
  .dcnt          = 0,
  .flags         = 0,
  .status        = 0
};
#endif

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_lpi2c_getreg
 *
 * Description:
 *   Get a 32-bit register value by offset
 *
 ****************************************************************************/

static inline uint32_t
imxrt_lpi2c_getreg(struct imxrt_lpi2c_priv_s *priv, uint16_t offset)
{
  return getreg32(priv->config->base + offset);
}

/****************************************************************************
 * Name: imxrt_lpi2c_putreg
 *
 * Description:
 *  Put a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void imxrt_lpi2c_putreg(struct imxrt_lpi2c_priv_s *priv,
                                      uint16_t offset, uint32_t value)
{
  putreg32(value, priv->config->base + offset);
}

/****************************************************************************
 * Name: imxrt_lpi2c_modifyreg
 *
 * Description:
 *   Modify a 32-bit register value by offset
 *
 ****************************************************************************/

static inline void imxrt_lpi2c_modifyreg(struct imxrt_lpi2c_priv_s *priv,
                                         uint16_t offset, uint32_t clearbits,
                                         uint32_t setbits)
{
  modifyreg32(priv->config->base + offset, clearbits, setbits);
}

/****************************************************************************
 * Name: imxrt_lpi2c_toticks
 *
 * Description:
 *   Return a micro-second delay based on the number of bytes left to be
 *   processed.
 *
 ****************************************************************************/

#ifdef CONFIG_IMXRT_LPI2C_DYNTIMEO
static uint32_t imxrt_lpi2c_toticks(int msgc, struct i2c_msg_s *msgs)
{
  int i;
  size_t bytecount = 0;
  uint32_t tick    = 0;

  /* Count the number of bytes left to process */

  for (i = 0; i < msgc; i++)
    {
      bytecount += msgs[i].length;
    }

  /* Then return a number of microseconds based on a user provided scaling
   * factor.
   */

  tick = USEC2TICK(CONFIG_IMXRT_LPI2C_DYNTIMEO_USECPERBYTE * bytecount);
  if (tick == 0)
    {
      tick = 1;
    }

  return tick;
}
#endif

/****************************************************************************
 * Name: imxrt_lpi2c_sem_waitdone
 *
 * Description:
 *   Wait for a transfer to complete
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static inline int
imxrt_lpi2c_sem_waitdone(struct imxrt_lpi2c_priv_s *priv)
{
  irqstate_t flags;
  uint32_t regval;
  int ret;

  flags = enter_critical_section();

#ifdef CONFIG_IMXRT_LPI2C_DMA
  if (priv->dma == NULL)
    {
#endif
      /* Clear the TX and RX FIFOs */

