apache/nuttx/arch/arm/src/imxrt/imxrt_lpi2c.c
      if (trace->count != 0)
        {
          /* Yes.. bump up the trace index (unless out of trace entries) */

          if (priv->tndx >= (CONFIG_I2C_NTRACE - 1))
            {
              i2cerr("ERROR: Trace table overflow\n");
              return;
            }

          priv->tndx++;
          trace = &priv->trace[priv->tndx];
        }

      /* Initialize the new trace entry */

      imxrt_lpi2c_traceclear(priv);
      trace->status = status;
      trace->count  = 1;
      trace->time   = clock_systime_ticks();
    }
  else
    {
      /* Just increment the count of times that we have seen this status */

      trace->count++;
    }
}

static void imxrt_lpi2c_traceevent(struct imxrt_lpi2c_priv_s *priv,
                                   enum imxrt_trace_e event, uint32_t parm)
{
  struct imxrt_trace_s *trace;

  if (event != I2CEVENT_NONE)
    {
      trace = &priv->trace[priv->tndx];

      /* Initialize the new trace entry */

      trace->event = event;
      trace->parm  = parm;

      /* Bump up the trace index (unless we are out of trace entries) */

      if (priv->tndx >= (CONFIG_I2C_NTRACE - 1))
        {
          i2cerr("ERROR: Trace table overflow\n");
          return;
        }

      priv->tndx++;
      imxrt_lpi2c_traceclear(priv);
    }
}

static void imxrt_lpi2c_tracedump(struct imxrt_lpi2c_priv_s *priv)
{
  struct imxrt_trace_s *trace;
  int i;

  syslog(LOG_DEBUG, "Elapsed time: %ld\n",
         (long)(clock_systime_ticks() - priv->start_time));

  for (i = 0; i < priv->tndx; i++)
    {
      trace = &priv->trace[i];
      syslog(LOG_DEBUG,
             "%2d. STATUS: %08x COUNT: %3d EVENT: %s(%2d) PARM: %08x "
             "TIME: %d\n",
             i + 1, trace->status, trace->count,
             g_trace_names[trace->event],
             trace->event, trace->parm, trace->time - priv->start_time);
    }
}
#endif /* CONFIG_I2C_TRACE */

/****************************************************************************
 * Name: imxrt_lpi2c_setclock
 *
 * Description:
 *   Set the I2C clock
 *
 ****************************************************************************/

static void imxrt_lpi2c_setclock(struct imxrt_lpi2c_priv_s *priv,
                                 uint32_t frequency)
{
#if !defined(CONFIG_ARCH_FAMILY_IMXRT117x) && \
    !defined(CONFIG_ARCH_FAMILY_IMXRT118x)
  uint32_t pll3_div = 0;
  uint32_t lpi2c_clk_div;
#endif
  uint32_t src_freq = 0;
  uint32_t regval;
  uint32_t men;
  uint32_t prescale = 0;
  uint32_t best_prescale = 0;
  uint32_t best_clk_hi = 0;
  uint32_t abs_error = 0;
  uint32_t best_error = 0xffffffff;
  uint32_t clk_hi_cycle;
  uint32_t computed_rate;
  uint32_t count;

  /* Has the I2C bus frequency changed? */

  if (priv->config->mode == LPI2C_MASTER)
    {
      if (frequency != priv->frequency)
        {
          /* Disable the selected LPI2C peripheral to configure the new
           * clock if it is enabled.
           */

          men = imxrt_lpi2c_getreg(priv, IMXRT_LPI2C_MCR_OFFSET) &
                LPI2C_MCR_MEN;
          if (men)
            {
              imxrt_lpi2c_modifyreg(priv, IMXRT_LPI2C_MCR_OFFSET,
                                    LPI2C_MCR_MEN, 0);
            }

          /* Get the LPI2C clock source frequency */

#if defined(CONFIG_ARCH_FAMILY_IMXRT117x) || \
    defined(CONFIG_ARCH_FAMILY_IMXRT118x)
          if (priv->config->base == IMXRT_LPI2C1_BASE)
            {
              imxrt_get_rootclock(CCM_CR_LPI2C1, &src_freq);
            }
          else if (priv->config->base == IMXRT_LPI2C2_BASE)
            {
              imxrt_get_rootclock(CCM_CR_LPI2C2, &src_freq);
            }
          else if (priv->config->base == IMXRT_LPI2C3_BASE)
            {
              imxrt_get_rootclock(CCM_CR_LPI2C3, &src_freq);
            }
          else if (priv->config->base == IMXRT_LPI2C4_BASE)
            {
              imxrt_get_rootclock(CCM_CR_LPI2C4, &src_freq);
            }
          else if (priv->config->base == IMXRT_LPI2C5_BASE)
            {
              imxrt_get_rootclock(CCM_CR_LPI2C5, &src_freq);
            }
          else if (priv->config->base == IMXRT_LPI2C6_BASE)
            {
              imxrt_get_rootclock(CCM_CR_LPI2C6, &src_freq);
            }
#else
          if ((getreg32(IMXRT_CCM_CSCDR2) & CCM_CSCDR2_LPI2C_CLK_SEL) ==
              CCM_CSCDR2_LPI2C_CLK_SEL_OSC_CLK)
            {
              src_freq = BOARD_XTAL_FREQUENCY;
            }
          else
            {
              if ((getreg32(IMXRT_CCM_ANALOG_PLL_USB1) &
                   CCM_ANALOG_PLL_USB1_DIV_SELECT_MASK) != 0)
                {
                  pll3_div = 22;
                }
              else
                {
                  pll3_div = 20;
                }

              lpi2c_clk_div = (getreg32(IMXRT_CCM_CSCDR2) &
                               CCM_CSCDR2_LPI2C_CLK_PODF_MASK) >>
                              CCM_CSCDR2_LPI2C_CLK_PODF_SHIFT;
              lpi2c_clk_div = lpi2c_clk_div + 1;
              src_freq      = (BOARD_XTAL_FREQUENCY * pll3_div) /
                              (8 * lpi2c_clk_div) ;
            }
#endif

          /* LPI2C output frequency = (Source Clock (Hz)/ 2^prescale) /
           *   (CLKLO + 1 + CLKHI + 1 + ALIGN_DOWN((2 + FILTSCL)/2^prescale)
           *
           * Assume  CLKLO = 2 * CLKHI, SETHOLD = CLKHI, DATAVD = CLKHI / 2
           */

          for (prescale = 1;
               (prescale <= 128) && (best_error != 0);
               prescale *= 2)
            {
              for (clk_hi_cycle = 1; clk_hi_cycle < 32; clk_hi_cycle++)
                {
                  if (clk_hi_cycle == 1)
                    {
                      computed_rate = (src_freq / prescale) /
                                      (6 + (2 / prescale));
                    }
                  else
                    {
                      computed_rate = (src_freq / prescale) /
                                      ((3 * clk_hi_cycle + 2) +
                                      (2 / prescale));
                    }

