apache/nuttx/arch/arm/src/imxrt/imxrt_lpi2c.c
              /* Last byte of last message? */

              if ((priv->msgc <= 0) && (priv->dcnt == 0))
                {
                  if ((priv->flags & I2C_M_NOSTOP) == 0)
                    {
                      imxrt_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

                      /* Do this once */

                      priv->flags |= I2C_M_NOSTOP;
                      imxrt_lpi2c_sendstop(priv);
                    }
                }
            }
        }

      /* Check if there is more bytes to read */

      else if (((priv->flags & I2C_M_READ) != 0) &&
               (status & LPI2C_MSR_RDF) != 0)
        {
          /* Read a byte, if dcnt goes < 0, read dummy bytes to ack ISRs */

          if (priv->dcnt > 0)
            {
              imxrt_lpi2c_traceevent(priv, I2CEVENT_RCVBYTE, priv->dcnt);

              /* No interrupts or context switches should occur in the
               * following sequence. Otherwise, additional bytes may be
               * sent by the device.
               */

    #ifdef CONFIG_I2C_POLLED
              irqstate_t flags = enter_critical_section();
    #endif

              /* Receive a byte */

              *priv->ptr++ = imxrt_lpi2c_getreg(priv,
                                                IMXRT_LPI2C_MRDR_OFFSET) &
                                                LPI2C_MRDR_DATA_MASK;
              priv->dcnt--;

    #ifdef CONFIG_I2C_POLLED
              leave_critical_section(flags);
    #endif
              /* Last byte of last message? */

              if ((priv->msgc <= 0) && (priv->dcnt == 0))
                {
                  if ((priv->flags & I2C_M_NOSTOP) == 0)
                    {
                      imxrt_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

                      /* Do this once */

                      priv->flags |= I2C_M_NOSTOP;
                      imxrt_lpi2c_sendstop(priv);
                    }
                }
            }
          else
            {
              /* Read and discard data */

              imxrt_lpi2c_getreg(priv, IMXRT_LPI2C_MRDR_OFFSET);
            }
        }

      /* Start the first or next message */

      if (priv->dcnt <= 0 && (status & (LPI2C_MSR_EPF | LPI2C_MSR_SDF)) == 0)
        {
          if (priv->msgc > 0 && priv->msgv != NULL)
            {
              priv->ptr   = priv->msgv->buffer;
              priv->dcnt  = priv->msgv->length;
              priv->flags = priv->msgv->flags;

              if ((priv->flags & I2C_M_NOSTART) == 0)
                {
                  imxrt_lpi2c_traceevent(priv, I2CEVENT_STARTRESTART,
                                         priv->msgc);

                  /* Do this once */

                  priv->flags |= I2C_M_NOSTART;

                  imxrt_lpi2c_sendstart(priv, priv->msgv->addr);
                }
              else
                {
                  imxrt_lpi2c_traceevent(priv, I2CEVENT_NOSTART, priv->msgc);
                }

              priv->msgv++;
              priv->msgc--;

              if ((priv->flags & I2C_M_READ) != 0)
                {
#ifndef CONFIG_I2C_POLLED
                  /* Stop TX interrupt */

                  imxrt_lpi2c_modifyreg(priv, IMXRT_LPI2C_MIER_OFFSET,
                                        LPI2C_MIER_TDIE, LPI2C_MIER_RDIE);
#endif
                  /* Set LPI2C in read mode */

                  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MTDR_OFFSET,
                                     LPI2C_MTDR_CMD_RXD |
                                     LPI2C_MTDR_DATA((priv->dcnt - 1)));
                }
              else
                {
                  /* Send the first byte from tx buffer */

                  imxrt_lpi2c_traceevent(priv, I2CEVENT_SENDBYTE,
                                         priv->dcnt);
                  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MTDR_OFFSET,
                                     LPI2C_MTDR_CMD_TXD |
                                     LPI2C_MTDR_DATA(*priv->ptr++));
                  priv->dcnt--;

                  /* Last byte of last message? */

                  if ((priv->msgc <= 0) && (priv->dcnt == 0))
                    {
                      if ((priv->flags & I2C_M_NOSTOP) == 0)
                        {
                          imxrt_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

                          /* Do this once */

                          priv->flags |= I2C_M_NOSTOP;
                          imxrt_lpi2c_sendstop(priv);
                        }
                    }
                }
            }
        }
    }
  else
    {
      imxrt_lpi2c_traceevent(priv, I2CEVENT_ERROR, 0);

      priv->status = status;

      if ((priv->flags & I2C_M_NOSTOP) == 0)
        {
          imxrt_lpi2c_traceevent(priv, I2CEVENT_STOP, 0);

          /* Do this once */

          priv->flags |= I2C_M_NOSTOP;
          imxrt_lpi2c_sendstop(priv);
        }

      /* Clear the error */

      imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MSR_OFFSET,
                         (status & (LPI2C_MSR_NDF | LPI2C_MSR_ALF |
                                    LPI2C_MSR_FEF | LPI2C_MSR_EPF)));
    }

  /* Check for endof packet or Stop */

  if ((status & (LPI2C_MSR_EPF | LPI2C_MSR_SDF)) != 0)
    {
      /* Reset either or both */

      imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MSR_OFFSET, status &
                         (LPI2C_MSR_EPF | LPI2C_MSR_SDF));

      /* Was it both End of packet and Stop */

      if ((status & (LPI2C_MSR_EPF | LPI2C_MSR_SDF)) ==
          (LPI2C_MSR_EPF | LPI2C_MSR_SDF))
        {
#ifndef CONFIG_I2C_POLLED
          if (priv->intstate == INTSTATE_WAITING)
            {
              /* inform the thread that transfer is complete
               * and wake it up
               */

              priv->intstate = INTSTATE_DONE;

              imxrt_lpi2c_modifyreg(priv, IMXRT_LPI2C_MIER_OFFSET,
                                   LPI2C_MIER_TDIE | LPI2C_MIER_RDIE |
                                   LPI2C_MIER_NDIE | LPI2C_MIER_ALIE |
                                   LPI2C_MIER_SDIE | LPI2C_MIER_EPIE, 0);
              nxsem_post(&priv->sem_isr);
            }
#else
          priv->intstate = INTSTATE_DONE;
#endif
        }
    }

  return OK;
}

/****************************************************************************
 * Name: imxrt_lpi2c_isr
 *
 * Description:
 *   Common I2C interrupt service routine
 *
 ****************************************************************************/

#ifndef CONFIG_I2C_POLLED
static int imxrt_lpi2c_isr(int irq, void *context, void *arg)
{
  struct imxrt_lpi2c_priv_s *priv = (struct imxrt_lpi2c_priv_s *)arg;

  DEBUGASSERT(priv != NULL);
  int rv = imxrt_lpi2c_isr_process(priv);

