apache/nuttx/arch/arm/src/imxrt/imxrt_lpi2c.c
  return rv;
}
#endif

/****************************************************************************
 * Name: imxrt_lpi2c_clock_enable
 *
 * Description:
 *   Ungate LPI2C clock
 *
 ****************************************************************************/

void imxrt_lpi2c_clock_enable (uint32_t base)
{
  if (base == IMXRT_LPI2C1_BASE)
    {
      imxrt_clockall_lpi2c1();
    }
  else if (base == IMXRT_LPI2C2_BASE)
    {
      imxrt_clockall_lpi2c2();
    }
  else if (base == IMXRT_LPI2C3_BASE)
    {
      imxrt_clockall_lpi2c3();
    }
  else if (base == IMXRT_LPI2C4_BASE)
    {
#if !defined(CONFIG_ARCH_FAMILY_IMXRT117x) && \
    !defined(CONFIG_ARCH_FAMILY_IMXRT118x)
      imxrt_clockall_lpi2c4_serial();
#else
      imxrt_clockall_lpi2c4();
    }
  else if (base == IMXRT_LPI2C5_BASE)
    {
      imxrt_clockall_lpi2c5();
    }
  else if (base == IMXRT_LPI2C6_BASE)
    {
      imxrt_clockall_lpi2c6();
#endif
    }
}

/****************************************************************************
 * Name: imxrt_lpi2c_clock_disable
 *
 * Description:
 *   Gate LPI2C clock
 *
 ****************************************************************************/

void imxrt_lpi2c_clock_disable (uint32_t base)
{
  if (base == IMXRT_LPI2C1_BASE)
    {
      imxrt_clockoff_lpi2c1();
    }
  else if (base == IMXRT_LPI2C2_BASE)
    {
      imxrt_clockoff_lpi2c2();
    }
  else if (base == IMXRT_LPI2C3_BASE)
    {
      imxrt_clockoff_lpi2c3();
    }
  else if (base == IMXRT_LPI2C4_BASE)
    {
#if !defined(CONFIG_ARCH_FAMILY_IMXRT117x) && \
    !defined(CONFIG_ARCH_FAMILY_IMXRT118x)
      imxrt_clockoff_lpi2c4_serial();
#else
      imxrt_clockoff_lpi2c4();
    }
  else if (base == IMXRT_LPI2C5_BASE)
    {
      imxrt_clockoff_lpi2c5();
    }
  else if (base == IMXRT_LPI2C6_BASE)
    {
      imxrt_clockoff_lpi2c6();
#endif
    }
}

/****************************************************************************
 * Name: imxrt_lpi2c_init
 *
 * Description:
 *   Setup the I2C hardware, ready for operation with defaults
 *
 ****************************************************************************/

static int imxrt_lpi2c_init(struct imxrt_lpi2c_priv_s *priv)
{
  /* Power-up and configure GPIOs */

  /* Configure pins */

  imxrt_config_gpio(priv->config->scl_pin);
  imxrt_config_gpio(priv->config->sda_pin);

  /* Enable power and reset the peripheral */

  imxrt_lpi2c_clock_enable(priv->config->base);

  /* Reset LPI2C before configuring it */

  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MCR_OFFSET, LPI2C_MCR_RST);
  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MCR_OFFSET, 0);

  /* Disable doze mode (Set DOZEN bit in 1 to disable) */

  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MCR_OFFSET, LPI2C_MCR_DOZEN);

  /* Disable host request */

  imxrt_lpi2c_modifyreg(priv, IMXRT_LPI2C_MCFGR0_OFFSET,
                        LPI2C_MCFG0_HREN | LPI2C_MCFG0_HRSEL,
                        LPI2C_MCFG0_HRPOL);

  /* Disable AUTOSTOP and turn NAK Ignore off */

  imxrt_lpi2c_modifyreg(priv, IMXRT_LPI2C_MCFGR1_OFFSET,
                        LPI2C_MCFGR1_IGNACK | LPI2C_MCFGR1_AUTOSTOP, 0);

  /* Set tx and rx watermarks */

  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MFCR_OFFSET,
                     LPI2C_MFCR_TXWATER(0) | LPI2C_MFCR_RXWATER(0));

  /* Force a frequency update */

  priv->frequency = 0;
  imxrt_lpi2c_setclock(priv, 100000);

  /* Set scl, sda glitch filters and busy idle */

  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MCFGR2_OFFSET,
                     LPI2C_MCFG2_BUSIDLE(priv->config->busy_idle) |
                     LPI2C_MCFG2_FILTSCL_CYCLES(priv->config->filtscl) |
                     LPI2C_MCFG2_FILTSDA_CYCLES(priv->config->filtsda));

  /* Set pin low cycles to 0 (disable) */

  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MCFGR3_OFFSET,
                     LPI2C_MCFG3_PINLOW_CYCLES(0));

  /* Attach ISRs */

#ifndef CONFIG_I2C_POLLED
  irq_attach(priv->config->irq, imxrt_lpi2c_isr, priv);
  up_enable_irq(priv->config->irq);
#endif

  /* Enable I2C */

  imxrt_lpi2c_modifyreg(priv, IMXRT_LPI2C_MCR_OFFSET, 0, LPI2C_MCR_MEN);
  return OK;
}

/****************************************************************************
 * Name: imxrt_lpi2c_deinit
 *
 * Description:
 *   Shutdown the I2C hardware
 *
 ****************************************************************************/

static int imxrt_lpi2c_deinit(struct imxrt_lpi2c_priv_s *priv)
{
  /* Disable I2C */

  imxrt_lpi2c_modifyreg(priv, IMXRT_LPI2C_MCR_OFFSET, LPI2C_MCR_MEN, 0);

  /* Reset LPI2C */

  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MCR_OFFSET, LPI2C_MCR_RST);
  imxrt_lpi2c_putreg(priv, IMXRT_LPI2C_MCR_OFFSET, 0);

  /* Disable and detach interrupts */

#ifndef CONFIG_I2C_POLLED
  up_disable_irq(priv->config->irq);
  irq_detach(priv->config->irq);
#endif

  /* Disable clocking */

  imxrt_lpi2c_clock_disable(priv->config->base);

  return OK;
}

/****************************************************************************
 * Device Driver Operations
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_lpi2c_dma_configure
 *
 * Description:
 *   Create a TCD to change from TX to RX
 *
 ****************************************************************************/

#ifdef CONFIG_IMXRT_LPI2C_DMA
static int imxrt_lpi2c_dma_configure_mder(struct imxrt_lpi2c_priv_s *priv)
{
  struct imxrt_edma_xfrconfig_s config;

  memset(&config, 0, sizeof(config));

  config.saddr  = (uint32_t) &g_lpi2c_mder_rdde;
  config.daddr  = priv->config->base + IMXRT_LPI2C_MDER_OFFSET;
  config.soff   = 0;
  config.doff   = sizeof(uint8_t);
  config.iter   = 1;
  config.flags  = EDMA_CONFIG_LINKTYPE_LINKNONE;
  config.ssize  = EDMA_8BIT;
  config.dsize  = EDMA_8BIT;
  config.nbytes = sizeof(uint8_t);

  up_clean_dcache((uintptr_t)config.saddr ,
                       (uintptr_t)config.saddr + config.nbytes);

  return imxrt_dmach_xfrsetup(priv->dma, &config);
}
#endif

/****************************************************************************
 * Name: imxrt_lpi2c_dma_command_configure
 *
 * Description:
 *   Create a command TCD
 *
 ****************************************************************************/

#ifdef CONFIG_IMXRT_LPI2C_DMA
static int imxrt_lpi2c_dma_command_configure(struct imxrt_lpi2c_priv_s *priv,
                                             uint16_t *ccmd, uint32_t ncmd)
{
  struct imxrt_edma_xfrconfig_s config;

