apache/nuttx/arch/arm/src/imxrt/imxrt_lpi2c.c
  imxrt_lpi2c_setclock(priv, frequency);
  ret = OK;

out:

  /* Release the port for reuse by other clients */

  nxmutex_unlock(&priv->lock);
  return ret;
}
#endif /* CONFIG_I2C_RESET */

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: imxrt_i2cbus_initialize
 *
 * Description:
 *   Initialize one I2C bus
 *
 ****************************************************************************/

struct i2c_master_s *imxrt_i2cbus_initialize(int port)
{
  struct imxrt_lpi2c_priv_s * priv = NULL;
  irqstate_t flags;

  /* Get I2C private structure */

  switch (port)
    {
#ifdef CONFIG_IMXRT_LPI2C1
      case 1:
        {
          priv = (struct imxrt_lpi2c_priv_s *)&imxrt_lpi2c1_priv;
          break;
        }

#endif
#ifdef CONFIG_IMXRT_LPI2C2
      case 2:
        {
          priv = (struct imxrt_lpi2c_priv_s *)&imxrt_lpi2c2_priv;
          break;
        }

#endif
#ifdef CONFIG_IMXRT_LPI2C3
      case 3:
        {
          priv = (struct imxrt_lpi2c_priv_s *)&imxrt_lpi2c3_priv;
          break;
        }

#endif
#ifdef CONFIG_IMXRT_LPI2C4
      case 4:
        {
          priv = (struct imxrt_lpi2c_priv_s *)&imxrt_lpi2c4_priv;
          break;
        }

#endif
#ifdef CONFIG_IMXRT_LPI2C5
      case 5:
        {
          priv = (struct imxrt_lpi2c_priv_s *)&imxrt_lpi2c5_priv;
          break;
        }

#endif
#ifdef CONFIG_IMXRT_LPI2C6
      case 6:
        {
          priv = (struct imxrt_lpi2c_priv_s *)&imxrt_lpi2c6_priv;
          break;
        }

#endif
      default:
        {
          return NULL;
        }
    }

  /* Initialize private data for the first time, increment reference count,
   * power-up hardware and configure GPIOs.
   */

  flags = enter_critical_section();

  if ((volatile int)priv->refs++ == 0)
    {
      imxrt_lpi2c_init(priv);

#ifdef CONFIG_IMXRT_LPI2C_DMA
      if (priv->config->dma_reqsrc != 0)
        {
          priv->dma = imxrt_dmach_alloc(priv->config->dma_reqsrc |
                                        DMAMUX_CHCFG_ENBL, 0);
          DEBUGASSERT(priv->dma != NULL);
        }
#endif
    }

  leave_critical_section(flags);

  return (struct i2c_master_s *)priv;
}

/****************************************************************************
 * Name: imxrt_i2cbus_uninitialize
 *
 * Description:
 *   Uninitialize an I2C bus
 *
 ****************************************************************************/

int imxrt_i2cbus_uninitialize(struct i2c_master_s *dev)
{
  struct imxrt_lpi2c_priv_s *priv = (struct imxrt_lpi2c_priv_s *)dev;
  irqstate_t flags;

  DEBUGASSERT(dev);

  /* Decrement reference count and check for underflow */

  if (priv->refs == 0)
    {
      return ERROR;
    }

  flags = enter_critical_section();

  if (--priv->refs > 0)
    {
      leave_critical_section(flags);
      return OK;
    }

  leave_critical_section(flags);

  /* Disable power and other HW resource (GPIO's) */

#ifdef CONFIG_IMXRT_LPI2C_DMA
  if (priv->dma != NULL)
    {
      imxrt_dmach_stop(priv->dma);
      imxrt_dmach_free(priv->dma);
      priv->dma = NULL;
    }
#endif

  imxrt_lpi2c_deinit(priv);

  return OK;
}

#endif /* CONFIG_IMXRT_LPI2C */
